git init - .git  в этой папке находятся все нужные файлы

git remove add name url  - добавляет удаленный репозиторий который находится на каком нибудь сервере

git pull origin master  стягивает все ветки изменений

git status  показывает статус файла проекта 

git add добавляет файлы в рабочей папке в индекс

git add name file добавит в индекс определенный файл

git add. добавит все файлы

git commit она добавляет все файлы в индексе во внутренюю базу данных  и  сдвигает указатель ветки на слепок

git commit -m "comment" коментарий описывает git commit

git branch с этой командой можно посмотреть список веток

git branch name branch можно создать ветку с определнным названием

git checkout name branch переключение на ветку с данным названием

git push origin master  команда отвечает за отправку кода в репозиторий

git reset filename отвечает за удаление файла из индекса  
